
#トキポナ＋スワデシュリスト＋挨拶＋適宜ヒュムノス
#長いとエラーを起こしたので適当に小分けして合体
#ここにはどんどん単語を追加してください（自動で単語数に応じて生成されます）
#固有名詞の行は変更しないで
element1 = ['私','あなた','彼','私たち','あなたたち','彼ら','これ','あれ','ここ','そこ','誰','何','いつ','どう','ない','ある','すべて','多い','少ない','他','一','二','三','四','五','六','七','八','九','十','大きい','小さい','長い','広い','厚い','重い','小さい','短い','狭い','細い','女','男','人','魔物','神','悪魔','魔法','言葉']
element2 = ['する','話す','作る','子','妻','夫','母','父','動物','命','魚','鳥','犬','猫','虱','蛇','虫','木','森','枝','草','実','種','葉','根','樹皮','花','縄','糸']
element3 = ['皮膚','血','骨','脂','卵','角','尾','羽','髪','頭','耳','目','鼻','口','歯','舌','爪','足','脚','膝','手','翼','腹','腸','肝','首','背中','胸','心','飲む','食べる','噛む','吸う','吐く','息する','笑う','見る','聞く','知る','思う','嗅ぐ','恐れる','寝る','生きる','死ぬ','殺す','戦う','狩る','打つ','切る','割る','刺す','掻く','書く','掘る','泳ぐ','歩く','来る','横たわる','座る','立つ','回る','落ちる','与える','持つ','絞る','擦る','洗う','拭く','引く','押す','投げる','結ぶ','縫う','数える','縫う','言う','歌う','遊ぶ','浮く']
element4 = ['流れる','膨らむ','凍る','太陽','月','星','水','雨','川','湖','海','塩','石','砂','塵','土','雲','虹','霧','空','山','風','雪','氷','煙','火','灰','燃える','道','赤','緑','黄','白','黒','青','色','夜','日（暦）','月（暦）','年','あたたかい','寒い','満ちた','新しい','古い','良い','悪い','腐った','汚い','まっすぐ','丸い','鋭い','鈍い','滑らか','乾燥した','濡れた','正しい','遠い','近い','右','左']
element5 = ['とても','まだ','すでに','上手に','こんにちは','ありがとう','さようなら','ごめんなさい','～である','～を','～は','～で','～の中で','～とともに','そして','しかし','～こと','～したい','～できる','～した（過去）','～だろう（未来）','～しなければならない','～ではない','～しろ','～するな','～ならば','～しなくてもいい','ほしい','好き','愛する','～だから','名前']
proper_nouns = ['固有名詞1','固有名詞2','固有名詞3','固有名詞4','固有名詞5','固有名詞6']
elements = element1 + element2 + element3 + element4 + element5 + proper_nouns

#以下がメイン



autolang.py
Google ドキュメント で開く
autolang.py を表示しています。